app/views/posts/show.html.erb

      </div>
      <% if Like.find_by(user_id: @current_user.id, post_id: @post.id) %>
---
SELECT  `likes`.* FROM `likes` WHERE `likes`.`user_id` = 1 AND `likes`.`post_id` = 16 LIMIT 1