app/controllers/posts_controller.rb

  def index
    @posts=Post.all.order(created_at: :desc)
---
SELECT `posts`.* FROM `posts` ORDER BY `posts`.`created_at` DESC

  def create
    @post=Post.new(item: params[:item],
                  work: params[:work],
                  report: params[:report],
                  user_id: @current_user.id)
    @post.save

    @media=Medium.new(media_name: params[:media],
                      post_id: @post.id)
    @media.save
---
INSERT INTO `posts` (`item`, `work`, `report`, `created_at`, `updated_at`, `user_id`) VALUES ('欅坂の動画を見た', '', '鈴本が控えめに言って最高だった。', '2020-03-26 14:06:26', '2020-03-26 14:06:26', 1)
INSERT INTO `media` (`media_name`, `post_id`, `created_at`, `updated_at`) VALUES ('スクリーンショット_2020-03-09_21.15.33.png', 8, '2020-03-26 14:06:26', '2020-03-26 14:06:26')

  def show
    @post=Post.find_by(id: params[:id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1

  def edit
    @post=Post.find_by(id: params[:id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 16 LIMIT 1  [["id", 16], ["LIMIT", 1]]

  def update
    @post=Post.find_by(id: params[:id])
    @post.item=params[:item]
    @post.work=params[:work]
    @post.report=params[:report]
    @post.save
    @media=Medium.find_by(post_id: @post.id)
    @media.media_name=params[:media_name]
    if @media
      @media.save
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 10 LIMIT 1  [["id", 10], ["LIMIT", 1]]
UPDATE `posts` SET `report` = '植えきったのは9割で1割残した。植え残しと粒剤散布は明日に回した。明日は、明後日の天気が悪いので土づくりを優先して、それが終わり次第、今日の続きになりそう。', `updated_at` = '2020-03-12 10:13:32' WHERE `posts`.`id` = 4
UPDATE `media` SET `media_name` = 'スクリーンショット_2020-03-09_21.15.33.png', `updated_at` = '2020-03-26 14:53:27' WHERE `media`.`id` = 10

  def destroy
    @media=Medium.find_by(post_id: params[:id])
    if @media
     @media.destroy
    end
    @post=Post.find_by(id: params[:id])
---
DELETE FROM `media` WHERE `media`.`id` = 4
DELETE FROM `posts` WHERE `posts`.`id` = 6
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 8 LIMIT 1

  def ensure_correct_user
    @post = Post.find_by(id: params[:id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 16 LIMIT 1