app/controllers/users_controller.rb

  def show
    @user=User.find_by(id:params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def create
    @user=User.new(name:params[:name],
    email:params[:email],
    password:params[:password],
    prefecture:params[:prefecture],
    area:params[:area],
    cultivation_area:params[:cultivation_area]
    )
    if @user.save
---
INSERT INTO `users` (`name`, `email`, `password`, `prefecture`, `area`, `created_at`, `updated_at`) VALUES ('やてん', 'bf84st', 'yatennoaruji', '', '', '2020-06-04 10:36:35', '2020-06-04 10:36:35')

  def edit
    @user=User.find_by(id:params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def update
    @user=User.find_by(id:params[:id])

    @user.name=params[:name]
    @user.email=params[:email]
    @user.password=params[:password]
    @user.prefecture=params[:prefecture]
    @user.area=params[:area]
    @user.cultivation_area=params[:cultivation_area]

    @user.save
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `name` = '島村ファーム', `updated_at` = '2020-03-14 13:13:07' WHERE `users`.`id` = 1

  def login
    @user=User.find_by(email:params[:email], password:params[:password])
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'bf84st' AND `users`.`password` = 'yatennoaruji' LIMIT 1