app/models/post.rb

    def user
      return User.find_by(id: self.user_id)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1  [["id", 1], ["LIMIT", 1]]